Revit 2027 API
AnalyticalFixityState Enumeration
 Specifies the fixity setting of individual degrees of freedom in analytical release conditions.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AnalyticalFixityState
Public Enumeration AnalyticalFixityState
public enum class AnalyticalFixityState
type AnalyticalFixityState
Members
Member name | Value | Description
Fixed | 0 |  Degree of freedom is Fixed.
Released | 1 |  Degree of freedom is Released.
Spring | 2 |  Degree of freedom has a Spring coefficient.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace